In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 9, 0, 6, 17, 796000), 42, 'paid', None, None, 275, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 9, 0, 9, 46, 796000), 42, 'paid', None, None, 275, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 9, 0, 12, 27, 796000), 42, 'paid', None, None, 275, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 9, 0, 14, 52, 796000), 42, 'paid', None, None, 275, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 9, 0, 17, 44, 796000), 42, 'paid', None, None, 275, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(42, 'Harper', 'Barrett', 'M', 'paid'),
 (49, 'Chloe', 'Cuevas', 'F', 'free'),
 (6, 'Cecilia', 'Owens', 'F', 'free'),
 (24, 'Layla', 'Griffin', 'F', 'paid'),
 (80, 'Tegan', 'Levine', 'F', 'paid')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SONWXQJ12A8C134D94', 'The Ballad Of Sleeping Beauty', 'ARNF6401187FB57032', 1994, Decimal('305.162')),
 ('SOUPIRU12A6D4FA1E1', 'Der Kleine Dompfaff', 'ARJIE2Y1187B994AB7', 0, Decimal('152.92036')),
 ('SOWQTQZ12A58A7B63E', 'Streets On Fire (Explicit Album Version)', 'ARPFHN61187FB575F6', 0, Decimal('279.97995')),
 ('SOGDBUF12A8C140FAA', 'Intro', 'AR558FS1187FB45658', 2003, Decimal('75.67628')),
 ('SONSKXP12A8C13A2C9', 'Native Soul', 'AR0IAWL1187B9A96D0', 2003, Decimal('197.19791'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARNF6401187FB57032', 'Sophie B. Hawkins', 'New York, NY [Manhattan]', Decimal('40.79086'), Decimal('-73.96644')),
 ('ARJIE2Y1187B994AB7', 'Line Renaud', '', Decimal('NaN'), Decimal('NaN')),
 ('ARPFHN61187FB575F6', 'Lupe Fiasco', 'Chicago, IL', Decimal('41.88415'), Decimal('-87.63241')),
 ('AR558FS1187FB45658', '40 Grit', '', Decimal('NaN'), Decimal('NaN')),
 ('AR0IAWL1187B9A96D0', 'Danilo Perez', 'Panama', Decimal('8.4177'), Decimal('-80.11278'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(Decimal('1541721977796'), 0, 9, 45, 11, 2018, 'Friday'),
 (Decimal('1541722186796'), 0, 9, 45, 11, 2018, 'Friday'),
 (Decimal('1541722347796'), 0, 9, 45, 11, 2018, 'Friday'),
 (Decimal('1541722492796'), 0, 9, 45, 11, 2018, 'Friday'),
 (Decimal('1541722664796'), 0, 9, 45, 11, 2018, 'Friday')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [8]:
# %sql SELECT * FROM songs LEFT JOIN artists ON songs.artist_id=artists.artist_id